
{
  "Asian Grizzled Skipper": {
    "Common Name": "Asian Grizzled Skipper",
    "Common Name_MR": "एशियन ग्रिझल्ड स्किपर",
    "Scientific Name": "Spialia galba",
    "Appearance": "Small, dark brown with numerous white spots on wings; checkered fringes.",
    "Appearance_MR": "लहान, गडद तपकिरी रंगाचे, पंखांवर अनेक पांढरे ठिपके आणि चौकडीसारख्या कडा.",
    "Habitat": "Open grasslands, scrub, disturbed areas.",
    "Habitat_MR": "मोकळी गवताळ मैदाने, झुडपे, मानवी वस्तीजवळील जागा.",
    "Locations": "India, Southeast Asia.",
    "Locations_MR": "भारत, दक्षिणपूर्व आशिया.",
    "Behavior": "Fast, erratic flight, often seen basking on low vegetation.",
    "Behavior_MR": "जलद, अनियमित उडणारे, अनेकदा कमी उंचीच्या वनस्पतींवर ऊन घेताना दिसते.",
    "Larval host plant": "Malvaceae family, particularly Sida species.",
    "Larval host plant_MR": "मालवेसी कुटुंब, विशेषतः सिडा प्रजाती.",
    "Interesting fact": "One of the smallest skippers, it is often overlooked due to its rapid and low flight.",
    "Interesting fact_MR": "सर्वात लहान स्किपरपैकी एक, ते त्याच्या जलद आणि कमी उंचीच्या उड्डाणामुळे अनेकदा दुर्लक्षित राहते.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Asian Grizzled Skipper.jpg"
  },
  "Baronet": {
    "Common Name": "Baronet",
    "Common Name_MR": "बॅरोनेट",
    "Scientific Name": "Symphaedra nais",
    "Appearance": "Bright orange-red with black markings and a distinct white band on the hindwing.",
    "Appearance_MR": "चमकदार नारंगी-लाल रंगाचे, काळ्या खुणा आणि मागील पंखांवर एक विशिष्ट पांढरा पट्टा.",
    "Habitat": "Forest clearings, well-wooded areas.",
    "Habitat_MR": "जंगलातील मोकळ्या जागा, भरपूर झाडे असलेली ठिकाणे.",
    "Locations": "India, Sri Lanka.",
    "Locations_MR": "भारत, श्रीलंका.",
    "Behavior": "Strong and rapid flight, perches on tree trunks, often seen near streams.",
    "Behavior_MR": "शक्तिशाली आणि जलद उडणारे, झाडांच्या खोडांवर बसते, अनेकदा ओढ्यांजवळ दिसते.",
    "Larval host plant": "Sterculia species, especially Sterculia urens.",
    "Larval host plant_MR": "स्टर्कुलिया प्रजाती, विशेषतः स्टर्कुलिया युरेनस.",
    "Interesting fact": "Known for its striking coloration, making it easily identifiable in its habitat.",
    "Interesting fact_MR": "त्याच्या आकर्षक रंगामुळे ते त्याच्या अधिवासात सहज ओळखता येते.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Baronet.jpg"
  },
  "Blue Mormon": {
    "Common Name": "Blue Mormon",
    "Common Name_MR": "ब्लू मॉर्मन",
    "Scientific Name": "Papilio polymnestor",
    "Appearance": "Large black butterfly with broad blue markings on hindwings. Hindwings have a chain of white spots near the margin.",
    "Appearance_MR": "मोठे काळे फुलपाखरू ज्याच्या मागील पंखांवर निळ्या रंगाचे ठळक डाग असतात. पंखांच्या कडेला पांढऱ्या ठिपक्यांची साखळी असते.",
    "Habitat": "Evergreen and deciduous forests, gardens, near rivers.",
    "Habitat_MR": "सदाहरित आणि पानगळी जंगलांमध्ये, बागांमध्ये आणि नद्यांच्या जवळ.",
    "Locations": "India (Western Ghats, Maharashtra), Sri Lanka.",
    "Locations_MR": "भारत (पश्चिम घाट, महाराष्ट्र), श्रीलंका.",
    "Behavior": "Strong flier, visits flowers, active in morning hours.",
    "Behavior_MR": "जोरदार उडणारे, फुलांना भेट देते, सकाळच्या वेळी सक्रिय असते.",
    "Larval host plant": "Various Rutaceae plants, especially Citrus species and Atalantia.",
    "Larval host plant_MR": "विविध रुटेसी वनस्पती, विशेषतः लिंबूवर्गीय प्रजाती आणि अटलँटिया.",
    "Interesting fact": "It is the state butterfly of Maharashtra, India. It's one of the largest butterflies in India.",
    "Interesting fact_MR": "हे महाराष्ट्राचे राज्य फुलपाखरू आहे. हे भारतातील सर्वात मोठ्या फुलपाखरांपैकी एक आहे.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Blue Mormon.jpg"
  },
  "Blue tiger": {
    "Common Name": "Blue Tiger",
    "Common Name_MR": "ब्लू टायगर",
    "Scientific Name": "Tirumala limniace",
    "Appearance": "Black with striking blue semi-transparent spots and streaks.",
    "Appearance_MR": "काळ्या रंगाचे, निळ्या रंगाचे आकर्षक अर्धपारदर्शक ठिपके आणि रेषा.",
    "Habitat": "Forests, gardens, open country.",
    "Habitat_MR": "जंगले, बागा, मोकळे प्रदेश.",
    "Locations": "India, Southeast Asia, Australia.",
    "Locations_MR": "भारत, दक्षिणपूर्व आशिया, ऑस्ट्रेलिया.",
    "Behavior": "Slow, soaring flight, often migrates in large numbers, feeds on nectar.",
    "Behavior_MR": "हळू आणि वरच्या दिशेने उडणारे, अनेकदा मोठ्या संख्येने स्थलांतर करते, फुलांमधील मध खाते.",
    "Larval host plant": "Various milkweeds and other plants in the Asclepiadaceae family, like Leptadenia reticulata and Asclepias curassavica.",
    "Larval host plant_MR": "विविध रुईच्या प्रजाती आणि एस्क्लेपियाडेसी कुटुंबातील इतर वनस्पती, जसे की लेप्टाडेनिया रेटिकुलाटा आणि एस्क्लेपियास कुरासाविका.",
    "Interesting fact": "This butterfly is known for its migratory patterns, sometimes forming large swarms.",
    "Interesting fact_MR": "हे फुलपाखरू त्याच्या स्थलांतरणाच्या पद्धतींसाठी ओळखले जाते, काहीवेळा ते मोठे थवे तयार करते.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Blue tiger.jpg"
  },
  "Bush Hopper": {
    "Common Name": "Bush Hopper",
    "Common Name_MR": "बुश हॉपर",
    "Scientific Name": "Ampittia dioscorides",
    "Appearance": "Small, orange-brown with dark borders and a few small spots on forewings.",
    "Appearance_MR": "लहान, नारंगी-तपकिरी रंगाचे, गडद कडा आणि पुढील पंखांवर काही लहान ठिपके.",
    "Habitat": "Grassy areas, forest edges, scrub.",
    "Habitat_MR": "गवताळ प्रदेश, जंगलाच्या कडा, झुडपे.",
    "Locations": "India, Southeast Asia.",
    "Locations_MR": "भारत, दक्षिणपूर्व आशिया.",
    "Behavior": "Rapid, low flight, stays close to ground vegetation.",
    "Behavior_MR": "जलद, कमी उंचीवर उडणारे, जमिनीवरील वनस्पतींच्या जवळ राहते.",
    "Larval host plant": "Various grasses, including specific species of Poaceae.",
    "Larval host plant_MR": "विविध गवत, पोएसी (Poaceae) च्या विशिष्ट प्रजातींसह.",
    "Interesting fact": "Its rapid, jerky flight close to the ground makes it difficult to follow visually.",
    "Interesting fact_MR": "त्याच्या जमिनीजवळच्या जलद, धक्काबुक्कीच्या उड्डाणामुळे त्याला डोळ्यांनी पाहणे कठीण होते.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Bush Hopper.jpg"
  },
  "Cabbage White": {
    "Common Name": "Cabbage White",
    "Common Name_MR": "कॅबेज व्हाईट",
    "Scientific Name": "Pieris rapae",
    "Appearance": "White wings with black tips on forewings; females have two black spots.",
    "Appearance_MR": "पांढरे पंख, पुढील पंखांच्या टोकांवर काळे ठिपके; माद्यांना दोन काळे ठिपके असतात.",
    "Habitat": "Gardens, agricultural fields, open country.",
    "Habitat_MR": "बागा, शेतीची शेते, मोकळे प्रदेश.",
    "Locations": "Europe, Asia, North America (introduced).",
    "Locations_MR": "युरोप, आशिया, उत्तर अमेरिका (परिचित).",
    "Behavior": "Common garden pest, weak but erratic flight, visits various flowers.",
    "Behavior_MR": "सामान्य बागेतील कीटक, कमकुवत पण अनियमित उड्डाण, विविध फुलांना भेट देते.",
    "Larval host plant": "Brassicaceae (cabbage family) plants such as cabbage, broccoli, kale, and mustard.",
    "Larval host plant_MR": "ब्रॅसिकासी (कोबी कुटुंब) वनस्पती जसे की कोबी, ब्रोकोली, केल आणि मोहरी.",
    "Interesting fact": "It's a very widespread and well-known species, often considered a garden pest due to its larvae feeding on cruciferous vegetables.",
    "Interesting fact_MR": "ही एक अतिशय विस्तृत आणि सुप्रसिद्ध प्रजाती आहे, जी तिच्या अळ्या क्रूसिफेरस भाज्या खात असल्याने बागेतील कीटक मानली जाते.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Cabbage White.jpg"
  },
  "Commander butterfly": {
    "Common Name": "Commander Butterfly",
    "Common Name_MR": "कमांडर बटरफ्लाय",
    "Scientific Name": "Moduza procris",
    "Appearance": "Orange-brown with prominent black markings and a broad white band across both wings.",
    "Appearance_MR": "नारंगी-तपकिरी रंगाचे, ठळक काळ्या खुणा आणि दोन्ही पंखांवर एक रुंद पांढरा पट्टा.",
    "Habitat": "Forests, well-wooded areas, near streams.",
    "Habitat_MR": "जंगले, भरपूर झाडे असलेली ठिकाणे, ओढ्यांजवळ.",
    "Locations": "India, Southeast Asia.",
    "Locations_MR": "भारत, दक्षिणपूर्व आशिया.",
    "Behavior": "Gliding flight, often seen basking with wings open, feeds on rotting fruit.",
    "Behavior_MR": "ग्लायडिंग उड्डाण, अनेकदा पंख उघडे ठेवून ऊन घेताना दिसते, सडलेल्या फळांवर खाद्य करते.",
    "Larval host plant": "Various species of Salicaceae (willow family) like Salix and Populus.",
    "Larval host plant_MR": "सॅलिकासी (विल्लो कुटुंब) च्या विविध प्रजाती जसे की सॅलिक्स आणि पॉपुलस.",
    "Interesting fact": "Its gliding flight pattern is distinctive, resembling a 'sailor' in the air.",
    "Interesting fact_MR": "त्याची ग्लायडिंग उड्डाणाची पद्धत विशिष्ट आहे, हवेत 'नाविक' सारखी दिसते.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Commander butterfly.jpg"
  },
  "Common Awl": {
    "Common Name": "Common Awl",
    "Common Name_MR": "कॉमन ऑल",
    "Scientific Name": "Hasora badra",
    "Appearance": "Dark brown with a white spot on forewings and metallic green sheen on body.",
    "Appearance_MR": "गडद तपकिरी रंगाचे, पुढील पंखांवर एक पांढरा ठिपका आणि शरीरावर धातूसारखी हिरवी चमक.",
    "Habitat": "Thickets, forest edges, plantations.",
    "Habitat_MR": "झुडपांची दाट वाढ, जंगलाच्या कडा, plantations.",
    "Locations": "India, Southeast Asia.",
    "Locations_MR": "भारत, दक्षिणपूर्व आशिया.",
    "Behavior": "Fast and darting flight, active at dusk.",
    "Behavior_MR": "जलद आणि झेपावणारे उड्डाण, सायंकाळच्या वेळी सक्रिय असते.",
    "Larval host plant": "Leguminosae family, including Derris scandens and Pongamia pinnata.",
    "Larval host plant_MR": "लेग्युमिनोसी कुटुंब, डेरिस स्कॅन्डेन्स आणि पोंगामिया पिनाटासह.",
    "Interesting fact": "Awls are crepuscular, meaning they are most active during twilight hours.",
    "Interesting fact_MR": "ऑल्स संध्याकाळचे असतात, म्हणजे ते संध्याकाळच्या वेळी सर्वात जास्त सक्रिय असतात.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Common Awl.jpg"
  },
  "Common Baron": {
    "Common Name": "Common Baron",
    "Common Name_MR": "कॉमन बॅरन",
    "Scientific Name": "Euthalia aconthea",
    "Appearance": "Males are typically dull olive-brown with a darker border on the hindwings. Females are larger and more strikingly marked, often with a series of white or yellowish spots on the forewings and a reddish-brown hindwing with a dark margin. There can be some variation in markings.",
    "Appearance_MR": "नर साधारणपणे फिकट ऑलिव्ह-तपकिरी रंगाचे असतात आणि त्यांच्या मागील पंखांवर गडद कडा असते. मादी मोठी आणि अधिक आकर्षक खुणा असलेली असते, अनेकदा पुढील पंखांवर पांढऱ्या किंवा पिवळसर ठिपक्यांची मालिका असते आणि मागील पंख लालसर-तपकिरी रंगाचे आणि गडद कडा असलेले असतात. खुणांमध्ये काही फरक असू शकतो.",
    "Habitat": "Forests, wooded areas, often found in gardens and orchards with host plants.",
    "Habitat_MR": "जंगले, झाडे असलेली ठिकाणे, अनेकदा बागांमध्ये आणि फळबागांमध्ये यजमान वनस्पतींसोबत आढळतात.",
    "Locations": "India, Southeast Asia, including Sri Lanka, Myanmar, Thailand, Malaysia, Indonesia.",
    "Locations_MR": "भारत, दक्षिणपूर्व आशिया, श्रीलंका, म्यानमार, थायलंड, मलेशिया, इंडोनेशियासह.",
    "Behavior": "Strong, fast flight, often seen basking in sunlight. Males are territorial. Larvae feed on various plants, including mango (Mangifera indica) and cashew (Anacardium occidentale). Adults feed on rotting fruit and tree sap.",
    "Behavior_MR": "शक्तिशाली, जलद उड्डाण, अनेकदा सूर्यप्रकाशात ऊन घेताना दिसते. नर प्रादेशिक असतात. अळ्या आंबा (मँजिफेरा इंडिका) आणि काजू (अनाकार्डियम ऑक्सिडेंटेल) सह विविध वनस्पतींवर खाद्य करतात. प्रौढ सडलेल्या फळांवर आणि झाडांच्या रसावर खाद्य करतात.",
    "Larval host plant": "Mango (Mangifera indica) and Cashew (Anacardium occidentale) are common host plants.",
    "Larval host plant_MR": "आंबा (मँजिफेरा इंडिका) आणि काजू (अनाकार्डियम ऑक्सिडेंटेल) सामान्य यजमान वनस्पती आहेत.",
    "Interesting fact": "Males are known to be territorial and will chase away other butterflies from their perching spots.",
    "Interesting fact_MR": "नर प्रादेशिक असल्याचे ओळखले जातात आणि ते त्यांच्या बसण्याच्या ठिकाणांवरून इतर फुलपाखरांना पळवून लावतात.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Common Baron.jpg"
  },
  "Common Birdwing": {
    "Common Name": "Common Birdwing",
    "Common Name_MR": "कॉमन बर्डविंग",
    "Scientific Name": "Troides helena",
    "Appearance": "Large black butterfly with bright yellow hindwings and black veins.",
    "Appearance_MR": "मोठे काळे फुलपाखरू, चमकदार पिवळे मागील पंख आणि काळ्या शिरा.",
    "Habitat": "Dense forests, often near foothills.",
    "Habitat_MR": "दाट जंगले, अनेकदा डोंगर पायथ्याशी.",
    "Locations": "India, Southeast Asia.",
    "Locations_MR": "भारत, दक्षिणपूर्व आशिया.",
    "Behavior": "Powerful, graceful flight, feeds on nectar from large flowers, often flies high.",
    "Behavior_MR": "शक्तिशाली, मोहक उड्डाण, मोठ्या फुलांमधून मध खाते, अनेकदा उंच उडते.",
    "Larval host plant": "Aristolochia species (birthworts).",
    "Larval host plant_MR": "अरिस्टोलोकिया प्रजाती (बर्थवर्ट्स).",
    "Interesting fact": "It is one of the largest butterflies in India and is protected in some regions due to its striking beauty.",
    "Interesting fact_MR": "हे भारतातील सर्वात मोठ्या फुलपाखरांपैकी एक आहे आणि त्याच्या आकर्षक सौंदर्यमुळे काही प्रदेशात संरक्षित आहे.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Common Birdwing.jpg"
  },
  "Common Bushbrown": {
    "Common Name": "Common Bushbrown",
    "Common Name_MR": "कॉमन बुशब्राउन",
    "Scientific Name": "Mycalesis perseus",
    "Appearance": "Dull brown with small, indistinct eye spots on both wings, varying with seasons.",
    "Appearance_MR": "फिकट तपकिरी रंगाचे, दोन्ही पंखांवर लहान, अस्पष्ट डोळ्यांसारखे ठिपके, ऋतूनुसार बदलणारे.",
    "Habitat": "Undergrowth in forests, shaded areas.",
    "Habitat_MR": "जंगलातील झुडपांची वाढ, छायांकित क्षेत्रे.",
    "Locations": "India, Southeast Asia.",
    "Locations_MR": "भारत, दक्षिणपूर्व आशिया.",
    "Behavior": "Weak, low flight, often seen resting on leaves in shade.",
    "Behavior_MR": "कमकुवत, कमी उंचीवर उडणारे, अनेकदा सावलीत पानांवर विश्रांती घेताना दिसते.",
    "Larval host plant": "Various grasses, including Oryza sativa (rice) and other Poaceae species.",
    "Larval host plant_MR": "विविध गवत, ओरायझा सॅटिवा (भात) आणि इतर पोएसी प्रजातींसह.",
    "Interesting fact": "This butterfly exhibits seasonal dimorphism, meaning its appearance changes between the wet and dry seasons.",
    "Interesting fact_MR": "हे फुलपाखरू हंगामी द्विरूपता दर्शवते, म्हणजे पावसाळा आणि कोरड्या हंगामात त्याचे स्वरूप बदलते.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Common Bushbrown.jpg"
  },
  "Common Castor": {
    "Common Name": "Common Castor",
    "Common Name_MR": "कॉमन कॅस्टर",
    "Scientific Name": "Ariadne merione",
    "Appearance": "Orange-brown with wavy black lines and a distinct pattern on the hindwings.",
    "Appearance_MR": "नारंगी-तपकिरी रंगाचे, लहरी काळ्या रेषा आणि मागील पंखांवर एक विशिष्ट नमुना.",
    "Habitat": "Open forests, scrub, gardens.",
    "Habitat_MR": "मोकळी जंगले, झुडपे, बागा.",
    "Locations": "India, Southeast Asia.",
    "Locations_MR": "भारत, दक्षिणपूर्व आशिया.",
    "Behavior": "Darting flight, often rests with wings open on low vegetation.",
    "Behavior_MR": "झेपावणारे उड्डाण, अनेकदा कमी उंचीच्या वनस्पतींवर पंख उघडे ठेवून विश्रांती घेते.",
    "Larval host plant": "Ricinus communis (Castor oil plant) and other Euphorbiaceae members.",
    "Larval host plant_MR": "रिसिनस कम्युनिस (एरंडेल तेल वनस्पती) आणि इतर युफोरबियासी सदस्य.",
    "Interesting fact": "Named after its primary host plant, the castor oil plant, which is toxic to many animals.",
    "Interesting fact_MR": "त्याच्या प्राथमिक यजमान वनस्पती, एरंडेल तेल वनस्पतीवरून त्याचे नाव पडले आहे, जी अनेक प्राण्यांसाठी विषारी आहे.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Common Castor.jpg"
  },
  "Common crow": {
    "Common Name": "Common Crow",
    "Common Name_MR": "कॉमन क्रो",
    "Scientific Name": "Euploea core",
    "Appearance": "Dark brown to black wings with white spots on edges.",
    "Appearance_MR": "गडद तपकिरी ते काळे पंख, कडांवर पांढरे ठिपके.",
    "Habitat": "Forests, gardens, scrub.",
    "Habitat_MR": "जंगले, बागा, झुडपे.",
    "Locations": "India, Southeast Asia, Australia.",
    "Locations_MR": "भारत, दक्षिणपूर्व आशिया, ऑस्ट्रेलिया.",
    "Behavior": "Weak flier, feeds on milkweed, mimics toxic species.",
    "Behavior_MR": "कमकुवत उडणारे, मिल्कवीडवर खाद्य करते, विषारी प्रजातींचे अनुकरण करते.",
    "Larval host plant": "Various species of Apocynaceae and Asclepiadaceae, including milkweeds and Ficus species.",
    "Larval host plant_MR": "अपोसायनेसी आणि एस्क्लेपियाडेसीच्या विविध प्रजाती, मिल्कवीड्स आणि फायकस प्रजातींसह.",
    "Interesting fact": "It is a common mimicry model for other butterflies due to its toxicity, derived from the host plants its larvae feed on.",
    "Interesting fact_MR": "त्याच्या विषारीपणामुळे ते इतर फुलपाखरांसाठी सामान्य अनुकरण मॉडेल आहे, जे त्याच्या अळ्या ज्या यजमान वनस्पतींवर खाद्य करतात त्यातून मिळते.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Common crow.jpg"
  },
  "Common grass yellow": {
    "Common Name": "Common Grass Yellow",
    "Common Name_MR": "कॉमन ग्रास यलो",
    "Scientific Name": "Eurema hecabe",
    "Appearance": "Small yellow butterfly with black outer borders on wings.",
    "Appearance_MR": "लहान पिवळे फुलपाखरू, पंखांवर काळ्या बाह्य कडा.",
    "Habitat": "Grasslands, open areas, gardens.",
    "Habitat_MR": "गवताळ मैदाने, मोकळे प्रदेश, बागा.",
    "Locations": "Tropical Asia, Africa, Australia.",
    "Locations_MR": "उष्णकटिबंधीय आशिया, आफ्रिका, ऑस्ट्रेलिया.",
    "Behavior": "Fast flier, rests with wings closed.",
    "Behavior_MR": "जलद उडणारे, पंख मिटवून विश्रांती घेते.",
    "Larval host plant": "Various legumes and other plants, including Cassia species (e.g., Senna tora) and Mimosa pudica.",
    "Larval host plant_MR": "विविध शेंगा आणि इतर वनस्पती, कॅशिया प्रजाती (उदा. सेन्ना तोरा) आणि मिमोसा पुडिकासह.",
    "Interesting fact": "One of the most common and widespread butterfly species, found in almost every open grassy area.",
    "Interesting fact_MR": "सर्वात सामान्य आणि विस्तृत फुलपाखरू प्रजातींपैकी एक, जवळजवळ प्रत्येक मोकळ्या गवताळ प्रदेशात आढळते.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Common grass yellow.jpg"
  },
  "Common Gull": {
    "Common Name": "Common Gull",
    "Common Name_MR": "कॉमन गल",
    "Scientific Name": "Cepora nerissa",
    "Appearance": "White with black veins and borders on wings. Upperside black and white in dry season.",
    "Appearance_MR": "पांढऱ्या रंगाचे, पंखांवर काळ्या शिरा आणि कडा. कोरड्या हंगामात वरचा भाग काळा आणि पांढरा असतो.",
    "Habitat": "Open woodlands, scrub, gardens.",
    "Habitat_MR": "मोकळी जंगले, झुडपे, बागा.",
    "Locations": "India, Sri Lanka, Southeast Asia.",
    "Locations_MR": "भारत, श्रीलंका, दक्षिणपूर्व आशिया.",
    "Behavior": "Weak flier, feeds on nectar and rests often.",
    "Behavior_MR": "कमकुवत उडणारे, मध खाते आणि अनेकदा विश्रांती घेते.",
    "Larval host plant": "Capparidaceae family, especially Cadaba indica and Capparis species.",
    "Larval host plant_MR": "कॅपॅरिडासी कुटुंब, विशेषतः कॅडाबा इंडिका आणि कॅपरिस प्रजाती.",
    "Interesting fact": "The male and female have different patterns and coloration, and there is also seasonal variation in their appearance.",
    "Interesting fact_MR": "नर आणि मादीमध्ये वेगवेगळे नमुने आणि रंग असतात आणि त्यांच्या दिसण्यात हंगामी फरक देखील असतो.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Common Gull.jpg"
  },
  "Common Jay": {
    "Common Name": "Common Jay",
    "Common Name_MR": "कॉमन जे",
    "Scientific Name": "Graphium doson",
    "Appearance": "Black with prominent blue-green markings and spots on both wings, long tails on hindwings.",
    "Appearance_MR": "काळ्या रंगाचे, दोन्ही पंखांवर ठळक निळे-हिरवे ठिपके आणि खुणा, मागील पंखांवर लांब शेपटी.",
    "Habitat": "Forests, gardens, near water bodies.",
    "Habitat_MR": "जंगले, बागा, पाण्याच्या स्त्रोतांजवळ.",
    "Locations": "India, Southeast Asia.",
    "Locations_MR": "भारत, दक्षिणपूर्व आशिया.",
    "Behavior": "Fast, restless flier, often visits flowers, mud-puddles.",
    "Behavior_MR": "जलद, बेचैन उडणारे, अनेकदा फुलांना भेट देते, चिखलात बसते.",
    "Larval host plant": "Annonaceae family, including Polyalthia longifolia and Artabotrys hexapetalus.",
    "Larval host plant_MR": "एनोनासी कुटुंब, पॉलीअल्थिया लाँगिफोलिया आणि आर्टबोट्रिस हेक्सापेटलससह.",
    "Interesting fact": "Known for its rapid and direct flight, often seen mud-puddling in groups.",
    "Interesting fact_MR": "त्याच्या जलद आणि सरळ उड्डाणासाठी ओळखले जाते, अनेकदा गटांमध्ये चिखलात बसलेले दिसते.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Common Jay.jpg"
  },
  "Common Leopard": {
    "Common Name": "Common Leopard",
    "Common Name_MR": "कॉमन लेपर्ड",
    "Scientific Name": "Phalanta phalantha",
    "Appearance": "Bright orange-yellow butterfly with black spots resembling a leopard’s coat.",
    "Appearance_MR": "चमकदार नारंगी-पिवळे फुलपाखरू, बिबट्याच्या त्वचेसारखे काळे ठिपके.",
    "Habitat": "Open forests, grasslands, gardens.",
    "Habitat_MR": "मोकळी जंगले, गवताळ मैदाने, बागा.",
    "Locations": "Africa, India, Southeast Asia.",
    "Locations_MR": "आफ्रिका, भारत, दक्षिणपूर्व आशिया.",
    "Behavior": "Basks frequently, swift flier, visits flowers.",
    "Behavior_MR": "वारंवार ऊन घेते, जलद उडणारे, फुलांना भेट देते.",
    "Larval host plant": "Various Flacourtiaceae plants, such as Flacourtia indica and Smilax.",
    "Larval host plant_MR": "विविध फ्लाकोर्टियासी वनस्पती, जसे की फ्लाकोर्टिया इंडिका आणि स्माइलॅक्स.",
    "Interesting fact": "Its striking leopard-like spots make it easily recognizable.",
    "Interesting fact_MR": "त्याचे आकर्षक बिबट्यासारखे ठिपके त्याला सहज ओळखता येणारे बनवतात.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Common Leopard.jpg"
  },
  "Common Mime": {
    "Common Name": "Common Mime",
    "Common Name_MR": "कॉमन माईम",
    "Scientific Name": "Papilio clytia",
    "Appearance": "Mimics the Common Crow and Blue Tiger; can be black with white spots or black with blue streaks.",
    "Appearance_MR": "कॉमन क्रो आणि ब्लू टायगरचे अनुकरण करते; पांढऱ्या ठिपक्यांसह काळे किंवा निळ्या रेषांसह काळे असू शकते.",
    "Habitat": "Forests, gardens.",
    "Habitat_MR": "जंगले, बागा.",
    "Locations": "India, Southeast Asia.",
    "Locations_MR": "भारत, दक्षिणपूर्व आशिया.",
    "Behavior": "Slow, deliberate flight, mimicking toxic species.",
    "Behavior_MR": "हळू, हेतुपूर्वक उड्डाण, विषारी प्रजातींचे अनुकरण करते.",
    "Larval host plant": "Lauraceae family, including Cinnamomum and Litsea species.",
    "Larval host plant_MR": "लॉरासी कुटुंब, सिनामोमम आणि लिट्सिया प्रजातींसह.",
    "Interesting fact": "This butterfly is a remarkable mimic, with two distinct forms that mimic different toxic models.",
    "Interesting fact_MR": "हे फुलपाखरू एक उल्लेखनीय नक्कलकार आहे, ज्यामध्ये दोन भिन्न रूपे आहेत जी वेगवेगळ्या विषारी मॉडेल्सची नक्कल करतात.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Common Mime.jpg"
  },
  "Common Peacock": {
    "Common Name": "Common Peacock",
    "Common Name_MR": "कॉमन पीकॉक",
    "Scientific Name": "Papilio polyctor",
    "Appearance": "Iridescent green body with long hindwing tails and a red spot on the upper hindwing.",
    "Appearance_MR": "चमकदार हिरवे शरीर, लांब मागील पंखांची शेपटी आणि वरच्या मागील पंखांवर लाल ठिपका.",
    "Habitat": "Hill forests, valleys, streams.",
    "Habitat_MR": "डोंगरावरील जंगले, दऱ्या, ओढे.",
    "Locations": "India, Nepal, Bhutan.",
    "Locations_MR": "भारत, नेपाळ, भूतान.",
    "Behavior": "Territorial, strong flier, hill-soaring.",
    "Behavior_MR": "प्रादेशिक, जोरदार उडणारे, डोंगरावर उंच उडणारे.",
    "Larval host plant": "Rutaceae family, including Zanthoxylum species and Phellodendron amurense.",
    "Larval host plant_MR": "रुटेसी कुटुंब, झॅन्थॉक्सिलम प्रजाती आणि फेलोडेंड्रॉन एमुरेन्ससह.",
    "Interesting fact": "Its brilliant iridescent green coloration makes it one of the most beautiful butterflies in its range.",
    "Interesting fact_MR": "त्याच्या चमकदार हिरव्या रंगामुळे ते त्याच्या श्रेणीतील सर्वात सुंदर फुलपाखरांपैकी एक आहे.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Common Peacock.jpg"
  },
  "Common Pierrot": {
    "Common Name": "Common Pierrot",
    "Common Name_MR": "कॉमन पिएरोट",
    "Scientific Name": "Castalius rosimon",
    "Appearance": "White with intricate black spots and markings, particularly on the hindwings.",
    "Appearance_MR": "पांढऱ्या रंगाचे, गुंतागुंतीचे काळे ठिपके आणि खुणा, विशेषतः मागील पंखांवर.",
    "Habitat": "Open country, gardens, scrub.",
    "Habitat_MR": "मोकळे प्रदेश, बागा, झुडपे.",
    "Locations": "India, Southeast Asia.",
    "Locations_MR": "भारत, दक्षिणपूर्व आशिया.",
    "Behavior": "Small, delicate flier, often seen close to the ground, feeds on nectar.",
    "Behavior_MR": "लहान, नाजूक उडणारे, अनेकदा जमिनीजवळ दिसते, मध खाते.",
    "Larval host plant": "Ziziphus species, particularly Ziziphus jujuba.",
    "Larval host plant_MR": "झिझिफस प्रजाती, विशेषतः झिझिफस जुजुबा.",
    "Interesting fact": "Its distinct black and white pattern makes it easily identifiable, resembling a 'pierrot' clown costume.",
    "Interesting fact_MR": "त्याच्या विशिष्ट काळ्या आणि पांढऱ्या नमुन्यामुळे ते सहज ओळखता येते, 'पिएरोट' विदूषकाच्या वेशासारखे दिसते.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Common Pierrot.jpg"
  },
  "Common rose": {
    "Common Name": "Common Rose",
    "Common Name_MR": "कॉमन रोज",
    "Scientific Name": "Pachliopta aristolochiae",
    "Appearance": "Velvety black wings with pale streaks on forewings, red lunules on hindwings.",
    "Appearance_MR": "मखमली काळे पंख, पुढील पंखांवर फिकट रेषा, मागील पंखांवर लाल चंद्रकोरीसारखे ठिपके.",
    "Habitat": "Gardens, forests, urban areas up to 2400m.",
    "Habitat_MR": "बागा, जंगले, शहरी भागात २४०० मीटरपर्यंत.",
    "Locations": "India, Sri Lanka, Southeast Asia.",
    "Locations_MR": "भारत, श्रीलंका, दक्षिणपूर्व आशिया.",
    "Behavior": "Slow flier, mud-puddler, feeds on nectar.",
    "Behavior_MR": "हळू उडणारे, चिखलात बसणारे, मध खाते.",
    "Larval host plant": "Aristolochia species (birthworts), which render the butterfly toxic to predators.",
    "Larval host plant_MR": "अरिस्टोलोकिया प्रजाती (बर्थवर्ट्स), ज्यामुळे फुलपाखरू भक्षकांसाठी विषारी बनते.",
    "Interesting fact": "Its toxicity, derived from its larval host plant, protects it from predators, leading to its slow and deliberate flight.",
    "Interesting fact_MR": "त्याची विषारीता, जी त्याच्या अळीच्या यजमान वनस्पतीपासून येते, त्याला भक्षकांपासून वाचवते, ज्यामुळे त्याचे उड्डाण हळू आणि हेतुपूर्वक होते.",
    "IUCN Status": "Least Concern",
    "image": "assets/images/Common rose.jpg"
  },
  "Common Sailer": {
    "Common Name": "Common Sailer",
    "Common Name_MR": "कॉमन सेलर",
    "Scientific Name": "Neptis hylas",
    "Appearance": "Dark brown/black with a series of white bands and spots across the wings.",
    "Appearance_MR": "गडद तपकिरी/काळे रंगाचे, पंखांवर पांढऱ्या पट्ट्या आणि ठिपक्यांची मालिका.",
    "Habitat": "Forests, open woodlands.",
    "Habitat_MR": "जंगले, मोकळी जंगले.",
    "Locations": "India, Southeast Asia.",
    "Locations_MR": "भारत, दक्षिणपूर्व आशिया.",
    "Behavior": "Gliding flight resembling sailing, often rests with wings open.",
    "Behavior_MR": "नौकानयनासारखे ग्लायडिंग उड्डाण, अनेकदा पंख उघडे ठेवून विश्रांती घेते.",
    "Larval host plant": "Various plants including species from the Leguminosae, Euphorbiaceae, and Malvaceae families.",
    "Larval host plant_MR": "लेग्युमिनोसी, युफोरबियासी आणि मालवेसी कुटुंबातील प्रजातींसह विविध वनस्पती.",
    "Interesting fact": "Its characteristic 'sailing' flight, with short bursts of flapping followed by long glides, gives it its common name.",
    "Interesting fact_MR": "त्याच्या वैशिष्ट्यपूर्ण 'सेलिंग' उड्डाणामुळे, ज्यात पंखांची लहान झटके आणि त्यानंतर लांब ग्लाइड्स असतात, त्याला त्याचे सामान्य नाव मिळाले आहे.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Common Sailer.jpg"
  },
  "Common Spotted flat": {
    "Common Name": "Common Spotted Flat",
    "Common Name_MR": "कॉमन स्पॉटेड फ्लॅट",
    "Scientific Name": "Celaenorrhinus leucocera",
    "Appearance": "Dark brown with prominent white translucent spots on forewings.",
    "Appearance_MR": "गडद तपकिरी रंगाचे, पुढील पंखांवर ठळक पांढरे पारदर्शक ठिपके.",
    "Habitat": "Forests, dense undergrowth.",
    "Habitat_MR": "जंगले, दाट झुडपांची वाढ.",
    "Locations": "India, Southeast Asia.",
    "Locations_MR": "भारत, दक्षिणपूर्व आशिया.",
    "Behavior": "Fast, direct flight, often rests with wings flattened, crepuscular.",
    "Behavior_MR": "जलद, सरळ उड्डाण, अनेकदा पंख सपाट ठेवून विश्रांती घेते, संध्याकाळचे.",
    "Larval host plant": "Strobilanthes species.",
    "Larval host plant_MR": "स्ट्रोबिलँथेस प्रजाती.",
    "Interesting fact": "Like other 'flats', it typically rests with its wings held flat, distinguishing it from other skippers.",
    "Interesting fact_MR": "इतर 'फ्लॅट्स' प्रमाणे, ते सहसा आपले पंख सपाट ठेवून विश्रांती घेते, ज्यामुळे ते इतर स्किपरपासून वेगळे होते.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Common Spotted flat.jpg"
  },
  "Forest Hopper": {
    "Common Name": "Forest Hopper",
    "Common Name_MR": "फॉरेस्ट हॉपर",
    "Scientific Name": "Astictopterus jama",
    "Appearance": "Small, dark brown with a few faint markings on the forewings.",
    "Appearance_MR": "लहान, गडद तपकिरी रंगाचे, पुढील पंखांवर काही अस्पष्ट खुणा.",
    "Habitat": "Forests, dense shade.",
    "Habitat_MR": "जंगले, दाट सावली.",
    "Locations": "India, Southeast Asia.",
    "Locations_MR": "भारत, दक्षिणपूर्व आशिया.",
    "Behavior": "Rapid, jerky flight, stays close to the forest floor.",
    "Behavior_MR": "जलद, धक्काबुक्कीचे उड्डाण, जंगलातील जमिनीजवळ राहते.",
    "Larval host plant": "Various grasses found in forest undergrowth.",
    "Larval host plant_MR": "जंगलातील झुडपांमध्ये आढळणारे विविध गवत.",
    "Interesting fact": "Its preference for dense forest shade makes it a less commonly observed species compared to open-country butterflies.",
    "Interesting fact_MR": "त्याची दाट जंगल सावलीची आवड त्याला मोकळ्या प्रदेशातील फुलपाखरांच्या तुलनेत कमी दिसणारी प्रजाती बनवते.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Forest Hopper.jpg"
  },
  "Grass Demon": {
    "Common Name": "Grass Demon",
    "Common Name_MR": "ग्रास डेमन",
    "Scientific Name": "Udaspes folus",
    "Appearance": "Dark brown with bold, irregular white markings on both wings.",
    "Appearance_MR": "गडद तपकिरी रंगाचे, दोन्ही पंखांवर ठळक, अनियमित पांढऱ्या खुणा.",
    "Habitat": "Grasslands, open areas, gardens.",
    "Habitat_MR": "गवताळ मैदाने, मोकळे प्रदेश, बागा.",
    "Locations": "India, Southeast Asia.",
    "Locations_MR": "भारत, दक्षिणपूर्व आशिया.",
    "Behavior": "Very fast, darting flight, often rests with wings half open, common in disturbed areas.",
    "Behavior_MR": "अतिशय जलद, झेपावणारे उड्डाण, अनेकदा पंख अर्धवट उघडे ठेवून विश्रांती घेते, disturbed भागात सामान्य.",
    "Larval host plant": "Various ginger family plants (Zingiberaceae), including ginger and turmeric.",
    "Larval host plant_MR": "विविध आले कुटुंबातील वनस्पती (झिंगिबेरेसी), आले आणि हळद यांचा समावेश.",
    "Interesting fact": "Despite its relatively small size, its extremely fast and erratic flight makes it challenging to catch or photograph.",
    "Interesting fact_MR": "त्याच्या तुलनेने लहान आकार असूनही, त्याचे अत्यंत जलद आणि अनियमित उड्डाण त्याला पकडणे किंवा छायाचित्रित करणे आव्हानात्मक बनवते.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Grass Demon.jpg"
  },
  "Great Eggfly": {
    "Common Name": "Great Eggfly",
    "Common Name_MR": "ग्रेट एगफ्लाय",
    "Scientific Name": "Hypolimnas bolina",
    "Appearance": "Males are glossy black with an iridescent blue sheen and white patches. Females are brown with white and orange.",
    "Appearance_MR": "नर चमकदार काळे असतात, इंद्रधनुषी निळी चमक आणि पांढरे ठिपके असतात. मादी तपकिरी रंगाची असते, पांढऱ्या आणि नारंगी रंगाच्या खुणा असतात.",
    "Habitat": "Gardens, fields, forest clearings.",
    "Habitat_MR": "बागा, शेते, जंगलातील मोकळ्या जागा.",
    "Locations": "Africa, Asia, Australia.",
    "Locations_MR": "आफ्रिका, आशिया, ऑस्ट्रेलिया.",
    "Behavior": "Mimics toxic butterflies, guards eggs.",
    "Behavior_MR": "विषारी फुलपाखरांचे अनुकरण करते, अंडी राखते.",
    "Larval host plant": "Various plants from the Urticaceae (nettle family) and Acanthaceae families, such as Sida rhombifolia and Portulaca oleracea.",
    "Larval host plant_MR": "उर्टिकासी (नेटल कुटुंब) आणि अ‍ॅकँथासी कुटुंबातील विविध वनस्पती, जसे की सिडा र्‍होम्बीफोलिया आणि पोर्टुलाका ओलेरासिया.",
    "Interesting fact": "The females are highly polymorphic and mimic several unpalatable butterfly species, an excellent example of Batesian mimicry.",
    "Interesting fact_MR": "मादी अत्यंत बहुरूपी असतात आणि अनेक अप्रिय फुलपाखरू प्रजातींचे अनुकरण करतात, बेटेशियन मिमिक्रीचे एक उत्कृष्ट उदाहरण.",
    "IUCN Status": "Least Concern",
    "image": "assets/images/Great Eggfly.jpg"
  },
  "Indian Jezebel": {
    "Common Name": "Indian Jezebel",
    "Common Name_MR": "इंडियन जेजेबेल",
    "Scientific Name": "Delias eucharis",
    "Appearance": "White butterfly with yellow hindwings and red spots underneath.",
    "Appearance_MR": "पांढऱ्या रंगाचे फुलपाखरू, पिवळे मागील पंख आणि खाली लाल ठिपके.",
    "Habitat": "Woodlands, gardens, up to 2000m.",
    "Habitat_MR": "जंगले, बागा, २००० मीटरपर्यंत.",
    "Locations": "India, Southeast Asia.",
    "Locations_MR": "भारत, दक्षिणपूर्व आशिया.",
    "Behavior": "Fast flyer, rests with wings closed, feeds on nectar.",
    "Behavior_MR": "जलद उडणारे, पंख मिटवून विश्रांती घेते, मध खाते.",
    "Larval host plant": "Loranthus species (mistletoes) and other parasitic plants.",
    "Larval host plant_MR": "लोरँथस प्रजाती (मिस्टलटो) आणि इतर परजीवी वनस्पती.",
    "Interesting fact": "The bright underside coloration serves as a warning to predators, indicating its distastefulness, which is acquired from its host plant.",
    "Interesting fact_MR": "त्याच्या खालच्या बाजूची चमकदार रंगीतता भक्षकांना चेतावणी म्हणून कार्य करते, जी त्याची अप्रियता दर्शवते, जी त्याच्या यजमान वनस्पतीपासून मिळते.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Indian Jezebel.jpg"
  },
  "Indian Oakblue": {
    "Common Name": "Indian Oakblue",
    "Common Name_MR": "इंडियन ओकबुल",
    "Scientific Name": "Arhopala atrax",
    "Appearance": "Brilliant iridescent blue upperside, dull brown underside with faint markings.",
    "Appearance_MR": "चमकदार इंद्रधनुषी निळा वरचा भाग, फिकट तपकिरी खालचा भाग अस्पष्ट खुणांसह.",
    "Habitat": "Forests, particularly near oak trees.",
    "Habitat_MR": "जंगले, विशेषतः ओक झाडांजवळ.",
    "Locations": "India, Southeast Asia.",
    "Locations_MR": "भारत, दक्षिणपूर्व आशिया.",
    "Behavior": "Fast flight, often seen around tree canopies, feeds on honeydew.",
    "Behavior_MR": "जलद उड्डाण, अनेकदा झाडांच्या छताभोवती दिसते, मध खाते.",
    "Larval host plant": "Quercus species (oak trees).",
    "Larval host plant_MR": "क्वेर्कस प्रजाती (ओक झाडे).",
    "Interesting fact": "Its stunning iridescent blue is only visible from certain angles, making it appear dull brown when its wings are closed.",
    "Interesting fact_MR": "त्याचा चमकदार इंद्रधनुषी निळा रंग फक्त विशिष्ट कोनातून दिसतो, ज्यामुळे पंख मिटवल्यावर तो फिकट तपकिरी दिसतो.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Indian Oakblue.jpg"
  },
  "Indian Purple Emperor": {
    "Common Name": "Indian Purple Emperor",
    "Common Name_MR": "इंडियन पर्पल एम्परर",
    "Scientific Name": "Dilipa mortip",
    "Appearance": "Males have iridescent purple-blue sheen on dark wings; females are duller brown.",
    "Appearance_MR": "नरांच्या गडद पंखांवर इंद्रधनुषी जांभळी-निळी चमक असते; मादी फिकट तपकिरी असतात.",
    "Habitat": "Hill forests, near streams.",
    "Habitat_MR": "डोंगरावरील जंगले, ओढ्यांजवळ.",
    "Locations": "Himalayas (India, Nepal).",
    "Locations_MR": "हिमालय (भारत, नेपाळ).",
    "Behavior": "Strong, erratic flight, often seen basking on rocks or leaves.",
    "Behavior_MR": "शक्तिशाली, अनियमित उड्डाण, अनेकदा खडक किंवा पानांवर ऊन घेताना दिसते.",
    "Larval host plant": "Unknown, likely a species found in high-altitude forests.",
    "Larval host plant_MR": "अज्ञात, कदाचित उच्च उंचीवरील जंगलांमध्ये आढळणारी प्रजाती.",
    "Interesting fact": "The iridescent purple sheen on the male's wings is a result of structural coloration, changing with the angle of light.",
    "Interesting fact_MR": "नराच्या पंखांवरील इंद्रधनुषी जांभळी चमक ही संरचनात्मक रंगामुळे होते, जी प्रकाशाच्या कोनानुसार बदलते.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Indian purple emperor.jpg"
  },
  "Indian Wanderer": {
    "Common Name": "Indian Wanderer",
    "Common Name_MR": "इंडियन वंडरर",
    "Scientific Name": "Pareronia hippia",
    "Appearance": "Males are pale blue-white with black veins; females are yellow-white with black veins.",
    "Appearance_MR": "नर फिकट निळे-पांढरे असतात आणि त्यांना काळ्या शिरा असतात; मादी पिवळसर-पांढऱ्या असतात आणि त्यांना काळ्या शिरा असतात.",
    "Habitat": "Forests, forest edges.",
    "Habitat_MR": "जंगले, जंगलाच्या कडा.",
    "Locations": "India, Southeast Asia.",
    "Locations_MR": "भारत, दक्षिणपूर्व आशिया.",
    "Behavior": "Weak, floating flight, mimics species like the Blue Tiger.",
    "Behavior_MR": "कमकुवत, तरंगणारे उड्डाण, ब्लू टायगरसारख्या प्रजातींचे अनुकरण करते.",
    "Larval host plant": "Capparidaceae family, specifically Capparis species.",
    "Larval host plant_MR": "कॅपॅरिडासी कुटुंब, विशेषतः कॅपरिस प्रजाती.",
    "Interesting fact": "This butterfly is a remarkable mimic of the toxic Blue Tiger butterfly, gaining protection from predators.",
    "Interesting fact_MR": "हे फुलपाखरू विषारी ब्लू टायगर फुलपाखराची एक उल्लेखनीय नक्कल आहे, ज्यामुळे त्याला भक्षकांपासून संरक्षण मिळते.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Indian Wanderer.jpg"
  },
  "Lemon Pansy": {
    "Common Name": "Lemon Pansy",
    "Common Name_MR": "लेमन पँजी",
    "Scientific Name": "Junonia lemonias",
    "Appearance": "Brown with yellow and black eye spots, darker in the wet season.",
    "Appearance_MR": "तपकिरी रंगाचे, पिवळे आणि काळे डोळ्यांसारखे ठिपके, पावसाळ्यात गडद रंगाचे.",
    "Habitat": "Open lands, fields, gardens.",
    "Habitat_MR": "मोकळ्या जागा, शेते, बागा.",
    "Locations": "South Asia, Southeast Asia.",
    "Locations_MR": "दक्षिण आशिया, दक्षिणपूर्व आशिया.",
    "Behavior": "Territorial, perches in sunlight, visits flowers.",
    "Behavior_MR": "प्रादेशिक, सूर्यप्रकाशात बसते, फुलांना भेट देते.",
    "Larval host plant": "Acanthaceae family, including Nelsonia canescens and Barleria.",
    "Larval host plant_MR": "अ‍ॅकँथासी कुटुंब, नेल्सनिया कॅनेसेन्स आणि बार्लेरियासह.",
    "Interesting fact": "Like other pansies, it exhibits seasonal forms, with the wet season form being darker and having more prominent ocelli.",
    "Interesting fact_MR": "इतर पँजीप्रमाणे, ते हंगामी रूपे दर्शवते, ज्यात पावसाळ्यातील रूप गडद आणि अधिक ठळक डोळे असलेले असते.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Lemon Pansy.jpg"
  },
  "Lime Swallowtail": {
    "Common Name": "Lime Swallowtail",
    "Common Name_MR": "लाईम स्वॅलोटेल",
    "Scientific Name": "Papilio demoleus",
    "Appearance": "Black and yellow butterfly with red and blue hindwing spots.",
    "Appearance_MR": "काळे आणि पिवळे फुलपाखरू, मागील पंखांवर लाल आणि निळे ठिपके.",
    "Habitat": "Gardens, citrus orchards, rural lands.",
    "Habitat_MR": "बागा, लिंबूवर्गीय फळबागा, ग्रामीण भूभाग.",
    "Locations": "Asia, Australia, Middle East.",
    "Locations_MR": "आशिया, ऑस्ट्रेलिया, मध्य पूर्व.",
    "Behavior": "Erratic flyer, feeds on citrus; common pest.",
    "Behavior_MR": "अनियमित उडणारे, लिंबूवर्गीय वनस्पतींवर खाद्य करते; सामान्य कीटक.",
    "Larval host plant": "Various Rutaceae plants, especially Citrus species (lime, lemon, orange).",
    "Larval host plant_MR": "विविध रुटेसी वनस्पती, विशेषतः लिंबूवर्गीय प्रजाती (लाईम, लेमन, ऑरेंज).",
    "Interesting fact": "It is a well-known pest of citrus crops due to its larvae feeding on the leaves.",
    "Interesting fact_MR": "त्याच्या अळ्या पानांवर खाद्य करत असल्याने ते लिंबूवर्गीय पिकांचे एक सुप्रसिद्ध कीटक आहे.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Lime Swallowtail.jpg"
  },
  "Orange Oakleaf": {
    "Common Name": "Orange Oakleaf",
    "Common Name_MR": "ऑरेंज ओकलीफ",
    "Scientific Name": "Kallima inachus",
    "Appearance": "Upper side is vibrant blue and orange; underside perfectly mimics a dead leaf.",
    "Appearance_MR": "वरचा भाग तेजस्वी निळा आणि नारंगी असतो; खालचा भाग मृत पानाची अचूक नक्कल करतो.",
    "Habitat": "Forests, dense vegetation.",
    "Habitat_MR": "जंगले, दाट वनस्पती.",
    "Locations": "India, Southeast Asia.",
    "Locations_MR": "भारत, दक्षिणपूर्व आशिया.",
    "Behavior": "Flies erratically, when resting, wings are closed to resemble a leaf, excellent camouflage.",
    "Behavior_MR": "अनियमित उडते, विश्रांती घेताना पंख पानासारखे दिसण्यासाठी बंद करते, उत्कृष्ट छद्मावरण.",
    "Larval host plant": "Strobilanthes species and other plants in the Acanthaceae family.",
    "Larval host plant_MR": "स्ट्रोबिलँथेस प्रजाती आणि अ‍ॅकँथासी कुटुंबातील इतर वनस्पती.",
    "Interesting fact": "Its incredible camouflage, mimicking a dead leaf when its wings are closed, is one of the most famous examples in the insect world.",
    "Interesting fact_MR": "त्याचे अविश्वसनीय छद्मावरण, पंख मिटवल्यावर मृत पानाची नक्कल करते, हे कीटक जगातील सर्वात प्रसिद्ध उदाहरणांपैकी एक आहे.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Orange Oakleaf.jpg"
  },
  "Painted Lady": {
    "Common Name": "Painted Lady",
    "Common Name_MR": "पेंटेड लेडी",
    "Scientific Name": "Vanessa cardui",
    "Appearance": "Orange-brown wings with black and white spots, distinctive black and white markings on the tips of forewings.",
    "Appearance_MR": "नारंगी-तपकिरी पंख, काळे आणि पांढरे ठिपके, पुढील पंखांच्या टोकांवर विशिष्ट काळ्या आणि पांढऱ्या खुणा.",
    "Habitat": "Wide range, open areas, grasslands, gardens.",
    "Habitat_MR": "विस्तृत श्रेणी, मोकळे प्रदेश, गवताळ मैदाने, बागा.",
    "Locations": "Cosmopolitan (found almost worldwide).",
    "Locations_MR": "जागतिक (जवळपास जगभर आढळते).",
    "Behavior": "Strong, migratory flier, visits various flowers for nectar.",
    "Behavior_MR": "शक्तिशाली, स्थलांतरित उडणारे, मध घेण्यासाठी विविध फुलांना भेट देते.",
    "Larval host plant": "Thistles (Cirsium and Carduus species), mallows, and various other herbaceous plants.",
    "Larval host plant_MR": "थिसल्स (सिरसियम आणि कार्डुस प्रजाती), मॉलो, आणि इतर विविध औषधी वनस्पती.",
    "Interesting fact": "Known for its incredible migratory journeys, sometimes traveling thousands of miles.",
    "Interesting fact_MR": "त्याच्या अविश्वसनीय स्थलांतरित प्रवासांसाठी ओळखले जाते, काहीवेळा हजारो मैल प्रवास करते.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Painted Lady.jpg"
  },
  "Peacock Pansy": {
    "Common Name": "Peacock Pansy",
    "Common Name_MR": "पीकॉक पँजी",
    "Scientific Name": "Junonia almana",
    "Appearance": "Orange-brown with prominent, colourful eye spots on both wings, resembling peacock feathers.",
    "Appearance_MR": "नारंगी-तपकिरी रंगाचे, दोन्ही पंखांवर ठळक, रंगीबेरंगी डोळ्यांसारखे ठिपके, मोराच्या पिसांसारखे दिसणारे.",
    "Habitat": "Open country, gardens, grasslands.",
    "Habitat_MR": "मोकळे प्रदेश, बागा, गवताळ मैदाने.",
    "Locations": "South Asia, Southeast Asia.",
    "Locations_MR": "दक्षिण आशिया, दक्षिणपूर्व आशिया.",
    "Behavior": "Territorial, perches on low vegetation, often seen basking in sunlight.",
    "Behavior_MR": "प्रादेशिक, कमी उंचीच्या वनस्पतींवर बसते, अनेकदा सूर्यप्रकाशात ऊन घेताना दिसते.",
    "Larval host plant": "Acanthaceae family, particularly Hygrophila auriculata and Justicia procumbens.",
    "Larval host plant_MR": "अ‍ॅकँथासी कुटुंब, विशेषतः हायग्रोफिला ऑरिकुलाटा आणि जस्टिशिया प्रोकुम्बेन्स.",
    "Interesting fact": "Its large, prominent eye-spots are thought to deter predators, mimicking the eyes of a larger animal.",
    "Interesting fact_MR": "त्याचे मोठे, ठळक डोळ्यांसारखे ठिपके भक्षकांना दूर ठेवतात असे मानले जाते, मोठ्या प्राण्याच्या डोळ्यांचे अनुकरण करतात.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Peacock Pansy.jpg"
  },
  "Plain tiger": {
    "Common Name": "Plain Tiger",
    "Common Name_MR": "प्लेन टायगर",
    "Scientific Name": "Danaus chrysippus",
    "Appearance": "Orange-brown wings with a black border and white spots.",
    "Appearance_MR": "नारंगी-तपकिरी पंख, काळ्या कडा आणि पांढरे ठिपके.",
    "Habitat": "Dry scrub, fields, open plains.",
    "Habitat_MR": "कोरडी झुडपे, शेते, मोकळी मैदाने.",
    "Locations": "Africa, Asia, Australia.",
    "Locations_MR": "आफ्रिका, आशिया, ऑस्ट्रेलिया.",
    "Behavior": "Mimics toxic butterflies, migratory.",
    "Behavior_MR": "विषारी फुलपाखरांचे अनुकरण करते, स्थलांतरित.",
    "Larval host plant": "Milkweeds (Asclepiadaceae family), such as Calotropis gigantea.",
    "Larval host plant_MR": "मिल्कवीड्स (एस्क्लेपियाडेसी कुटुंब), जसे की कॅलोट्रोपिस जायगँटिया.",
    "Interesting fact": "It is a classic example of Batesian mimicry, being mimicked by several other butterfly species due to its unpalatability.",
    "Interesting fact_MR": "हे बेटेशियन मिमिक्रीचे एक उत्कृष्ट उदाहरण आहे, त्याच्या अप्रियतेमुळे अनेक इतर फुलपाखरू प्रजाती त्याचे अनुकरण करतात.",
    "IUCN Status": "Least Concern",
    "image": "assets/images/Plain Tiger.jpg"
  },
  "Purple and Gold flitter": {
    "Common Name": "Purple and Gold Flitter",
    "Common Name_MR": "पर्पल अँड गोल्ड फ्लिटर",
    "Scientific Name": "Zographetus satwa",
    "Appearance": "Bright golden yellow with a purple tinge on the forewing base.",
    "Appearance_MR": "चमकदार सोनेरी पिवळे, पुढील पंखांच्या बुडाशी जांभळ्या रंगाची छटा.",
    "Habitat": "Evergreen and semi-evergreen forests.",
    "Habitat_MR": "सदाहरित आणि अर्ध-सदाहरित जंगले.",
    "Locations": "India (NE), Bangladesh, Southeast Asia.",
    "Locations_MR": "भारत (ईशान्य), बांगलादेश, दक्षिणपूर्व आशिया.",
    "Behavior": "Fast flier, rests on leaves, forest-dwelling.",
    "Behavior_MR": "जलद उडणारे, पानांवर विश्रांती घेते, जंगलात राहणारे.",
    "Larval host plant": "Unknown, likely a species found in the undergrowth of evergreen forests.",
    "Larval host plant_MR": "अज्ञात, कदाचित सदाहरित जंगलातील झुडपांमध्ये आढळणारी प्रजाती.",
    "Interesting fact": "This beautiful skipper is named for the unique combination of colors on its wings.",
    "Interesting fact_MR": "या सुंदर स्किपरला त्याच्या पंखांवरील रंगांच्या अद्वितीय संयोजनावरून नाव मिळाले आहे.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Purple and gold flitter.jpg"
  },
  "Red Breasted Jezebel": {
    "Common Name": "Red Breasted Jezebel",
    "Common Name_MR": "रेड ब्रेस्टेड जेजेबेल",
    "Scientific Name": "Delias acalis",
    "Appearance": "White with a black forewing border and red-orange hindwing base.",
    "Appearance_MR": "पांढऱ्या रंगाचे, पुढील पंखांना काळी कडा आणि मागील पंखांच्या बुडाशी लाल-नारंगी रंग.",
    "Habitat": "Hill forests and clearings.",
    "Habitat_MR": "डोंगरावरील जंगले आणि मोकळ्या जागा.",
    "Locations": "India (NE), Southeast Asia.",
    "Locations_MR": "भारत (ईशान्य), दक्षिणपूर्व आशिया.",
    "Behavior": "Canopy flier, visits flowers in the morning.",
    "Behavior_MR": "कॅनपी उडणारे, सकाळी फुलांना भेट देते.",
    "Larval host plant": "Loranthus species (mistletoes).",
    "Larval host plant_MR": "लोरँथस प्रजाती (मिस्टलटो).",
    "Interesting fact": "Like other Jezebels, its bright colors serve as a warning of its toxicity to predators.",
    "Interesting fact_MR": "इतर जेजेबेलप्रमाणे, त्याचे चमकदार रंग भक्षकांना त्याच्या विषारीपणाची चेतावणी म्हणून कार्य करतात.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Readbreast Jezebel.jpg"
  },
  "White Dragontail": {
    "Common Name": "White Dragontail",
    "Common Name_MR": "व्हाईट ड्रॅगनटेल",
    "Scientific Name": "Lamproptera curius",
    "Appearance": "Small, white with black veins and long, slender tails on hindwings, resembling dragonflies.",
    "Appearance_MR": "लहान, पांढरे रंगाचे, काळ्या शिरा आणि मागील पंखांवर लांब, बारीक शेपटी, ड्रॅगनफ्लायसारखे दिसणारे.",
    "Habitat": "Forests, near streams and water bodies.",
    "Habitat_MR": "जंगले, ओढे आणि पाण्याच्या स्त्रोतांजवळ.",
    "Locations": "India, Southeast Asia.",
    "Locations_MR": "भारत, दक्षिणपूर्व आशिया.",
    "Behavior": "Rapid, hovering flight, often seen in groups around water, unique flight pattern.",
    "Behavior_MR": "जलद, तरंगणारे उड्डाण, अनेकदा पाण्याच्या आसपास गटांमध्ये दिसते, अद्वितीय उड्डाण पद्धत.",
    "Larval host plant": "Hernandia nymphaeifolia and other plants in the Hernandiaceae family.",
    "Larval host plant_MR": "हर्नँडिया निम्फेआफोलिया आणि हर्नँडियासी कुटुंबातील इतर वनस्पती.",
    "Interesting fact": "Its long tails and transparent wings give it a remarkable resemblance to a dragonfly in flight, a form of mimicry.",
    "Interesting fact_MR": "त्याच्या लांब शेपटी आणि पारदर्शक पंखामुळे ते उडताना ड्रॅगनफ्लायसारखे दिसते, हे अनुकरणाचे एक रूप आहे.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/White Dragontail.jpg"
  },
  "Yellow Pansy": {
    "Common Name": "Yellow Pansy",
    "Common Name_MR": "यलो पँजी",
    "Scientific Name": "Junonia hierta",
    "Appearance": "Bright yellow with prominent black borders and a distinct black eye spot on the forewing.",
    "Appearance_MR": "चमकदार पिवळे रंगाचे, ठळक काळ्या कडा आणि पुढील पंखांवर एक विशिष्ट काळा डोळ्यांसारखा ठिपका.",
    "Habitat": "Open grasslands, dry areas, gardens.",
    "Habitat_MR": "मोकळी गवताळ मैदाने, कोरडे प्रदेश, बागा.",
    "Locations": "Africa, South Asia, Southeast Asia.",
    "Locations_MR": "आफ्रिका, दक्षिण आशिया, दक्षिणपूर्व आशिया.",
    "Behavior": "Fast, darting flight, territorial, often seen basking on the ground.",
    "Behavior_MR": "जलद, झेपावणारे उड्डाण, प्रादेशिक, अनेकदा जमिनीवर ऊन घेताना दिसते.",
    "Larval host plant": "Acanthaceae family, including Hygrophila and Striga species.",
    "Larval host plant_MR": "अ‍ॅकँथासी कुटुंब, हायग्रोफिला आणि स्ट्रिगा प्रजातींसह.",
    "Interesting fact": "Males are known for their territorial behavior, often perching and defending a sunny spot.",
    "Interesting fact_MR": "नर त्यांच्या प्रादेशिक वर्तनासाठी ओळखले जातात, अनेकदा सूर्यप्रकाशातील जागा निवडून तिचे रक्षण करतात.",
    "IUCN Status": "Not Evaluated",
    "image": "assets/images/Yellow Pansy.jpg"
  },
  "Yellow Veined lancer": {
    "Common Name": "Yellow Veined Lancer",
    "Common Name_MR": "यलो व्हेन्ड लान्सर",
    "Scientific Name": "Pyroneura latoia",
    "Appearance": "Dark brown with yellow streaks and prominent yellow veins on the underside.",
    "Appearance_MR": "गडद तपकिरी रंगाचे, पिवळ्या रेषा आणि खालच्या बाजूला ठळक पिवळ्या शिरा.",
    "Habitat": "Rainforests, nature reserves.",
    "Habitat_MR": "पर्जन्यवन, निसर्ग संवर्धन क्षेत्रे.",
    "Locations": "Malaysia, Singapore, Thailand.",
    "Locations_MR": "मलेशिया, सिंगापूर, थायलंड.",
    "Behavior": "Feeds on flowers, strong flyer near canopy.",
    "Behavior_MR": "फुलांवर खाद्य करते, कॅनपीजवळ जोरदार उडणारे.",
    "Larval host plant": "Licuala species (palm trees).",
    "Larval host plant_MR": "लिकुआला प्रजाती (पाम झाडे).",
    "Interesting fact": "This species is primarily found in undisturbed rainforests, indicating its sensitivity to habitat loss.",
    "Interesting fact_MR": "ही प्रजाती प्रामुख्याने undisturbed पर्जन्यवनात आढळते, ज्यामुळे तिच्या अधिवास नुकसानीची संवेदनशीलता दिसून येते."
  }
}
